In [11]:
import numpy as np
import pandas as pd

In [3]:
file_path = "/workspaces/tir103/data-pipeline/resource/data_with_nan.csv"
df = pd.read_csv(file_path)
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [4]:
df["col1"][3]

nan

In [5]:
type(df["col1"][3])

float

In [6]:
type(None)

NoneType

In [7]:
None + 1

TypeError: unsupported operand type(s) for +: 'NoneType' and 'int'

In [10]:
df["col2"].mean()

np.float64(28.5)

In [12]:
df[
    df["col1"].notna()
]

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [13]:
df[
    df["col1"].isna()
]

  col1  col2 col3
3  NaN   NaN  NaN
5  NaN   NaN  NaN

In [15]:
df[
    df["col1"].isnull()
]

  col1  col2 col3
3  NaN   NaN  NaN
5  NaN   NaN  NaN

In [16]:
help(df["col1"].isnull)

Help on method isnull in module pandas.core.series:

isnull() -> 'Series' method of pandas.core.series.Series instance
    Series.isnull is an alias for Series.isna.

    Detect missing values.

    Return a boolean same-sized object indicating if the values are NA.
    NA values, such as None or :attr:`numpy.NaN`, gets mapped to True
    values.
    Everything else gets mapped to False values. Characters such as empty
    strings ``''`` or :attr:`numpy.inf` are not considered NA values
    (unless you set ``pandas.options.mode.use_inf_as_na = True``).

    Returns
    -------
    Series
        Mask of bool values for each element in Series that
        indicates whether an element is an NA value.

    See Also
    --------
    Series.isnull : Alias of isna.
    Series.notna : Boolean inverse of isna.
    Series.dropna : Omit axes labels with missing values.
    isna : Top-level isna.

    Examples
    --------
    Show which entries in a DataFrame are NA.

    >>> df = pd.DataFrame(dict(age=[5, 6, np.nan],
    ...                        born=[pd.NaT, pd.Timestamp('1939-05-27'),
    ...                              pd.Timestamp('1940-04-25')],
    ...                        name=['Alfred', 'Batman', ''],
    ...                        toy=[None, 'Batmobile', 'Joker']))
    >>> df
       age       born    name        toy
    0  5.0        NaT  Alfred       None
    1  6.0 1939-05-27  Batman  Batmobile
    2  NaN 1940-04-25              Joker

    >>> df.isna()
         age   born   name    toy
    0  False   True  False   True
    1  False  False  False  False
    2   True  False  False  False

    Show which entries in a Series are NA.

    >>> ser = pd.Series([5, 6, np.nan])
    >>> ser
    0    5.0
    1    6.0
    2    NaN
    dtype: float64

    >>> ser.isna()
    0    False
    1    False
    2     True
    dtype: bool

In [17]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [18]:
df.dropna()

    col1  col2 col3
1  test2  44.0  aaa

In [19]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [20]:
df.dropna(thresh=1)

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [21]:
df.dropna(thresh=2)

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
4  test5   NaN  bbb

In [22]:
df["col2"].fillna(0)

0    13.0
1    44.0
2     0.0
3     0.0
4     0.0
5     0.0
Name: col2, dtype: float64

In [23]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [24]:
df["col2"] = df["col2"].fillna(0)
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   0.0  NaN
3    NaN   0.0  NaN
4  test5   0.0  bbb
5    NaN   0.0  NaN

In [25]:
df["col1"].fillna(method="ffill")

/tmp/ipykernel_62459/2941000901.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["col1"].fillna(method="ffill")

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object

In [26]:
df["col1"].ffill()

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object